
## Plan Result




<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_access_key
  * azurerm_key_vault_secret.redis_connection_string
  * module.redis-cache.azurerm_redis_cache.redis
  * module.redis-cache.azurerm_resource_group.cache-resourcegroup[0]
* Update
  * azurerm_resource_group.rg


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be created
  + resource "azurerm_key_vault_secret" "redis_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat"
      + name                    = "ia-redis-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_connection_string will be created
  + resource "azurerm_key_vault_secret" "redis_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat"
      + name                    = "ia-redis-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aip-frontend-aat"
        name     = "ia-aip-frontend-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ia-aip-frontend.git"
          - "application"         = "immigration"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-06-21T20:51:07Z"
          - "managedBy"           = "Immigration"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.redis-cache.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "ia-redis-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = "4"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "ia-redis-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ia-aip-frontend.git"
          + "application"         = "immigration"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ia-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Immigration"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.redis-cache.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ia-redis-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ia-aip-frontend.git"
          + "application"         = "immigration"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ia-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Immigration"
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":963,"Program":"tfcmt","SHA1":"","Vars":{}} -->